'''Задача №1'''

# Присваиваем значения переменным
anna_apples = 2
pol_apples = 5
# Выводим результат
print("У Анны", anna_apples, "яблока,", "а у Пола", pol_apples, "яблок")
print()

'''Задача №2'''

print('Задача №2')
# Задаем длину длину
length = int(input("Введите длину ребра куба: "))
# Находим объем куба
v = length ** 3
# Находим площадь боковой поверхности куба
s = 4 * length ** 2
# Выводим результат
print('Объем куба равен:', v)
print('Площадь боковой поверхности куба равна:', s)
print()

'''Задача №3'''

print('Задача №3')
# Высота дерева
tree_height = 20
# Расстояние за день
distance_day = 2
# Расстояние за ночь
distance_night = -1
# Находим количество дней
result = 20 * (distance_day + distance_night)
# Выводим результат
print('Улитка доползет до вершины дерева за', result, 'дней')

