import time
from random import randint

'''Задание №1'''

# Вводим данные
string_ = input('Ведите строку: ')
symbol = input('Введите символ: ')
# В цикле перебираем каждый символ строки
result = ''
for c in string_:
    if c == symbol:  # Если символ равен контрольному символу -
        continue  # пропускаем итерацию
    else:  # Если нет - добавляем к новой строке
        result += c
print(result)

# **********************************************************************************************************************

'''Задание №2'''

start = int(input('\nВведите начало последовательности: '))
end = int(input('Введите конец последовательности: '))
step = int(input('Введите шаг последовательности: '))
# Добавляем в цикл введенные данные
for i in range(start, end, step):
    print(i)  # Выводим на экран последовательность в заданном диапазоне

# **********************************************************************************************************************

'''Задание №3'''

print()
for num in range(54 + 1, 9184, 5):
    print(num)

# **********************************************************************************************************************

'''Задание №4'''

print()
list_dishes = ['творог', 'омлет', 'овощной салат',
               'бургер', 'йогурт', 'куриные грудки',
               'рыбное филе с овощами']

for dish in list_dishes:
    if dish == 'бургер':
        print(f'Я не ем на ужин {dish}')
    else:
        print(f'С удовольствием бы съел на ужин {dish}')

# **********************************************************************************************************************

'''Задание №6'''

print()
for i in range(1, 10):
    for j in range(1, 10):  # При помощи вложенного цикла перемножаем числа
        print(f'{i} * {j} = {i * j: <6}', end='')  # Выводим произведение в одну строчку
    print()  # Переходим на новую строку, чтобы выводить произведение следующего числа

# **********************************************************************************************************************

'''Творческое задание
Электронные часы'''

print()
for hours in range(24):  #  Цикл для отсчета часов
    for minutes in range(60):  # Цикл для отсчета минут
        for seconds in range(60):  # Цикл для отсчета секунд
            print(f'\r{hours}:{minutes}:{seconds}', end='')  # Выводим пезультат поверх предыдущего
            time.sleep(1)  # Задержка цикла

# **********************************************************************************************************************

'''Домашняя задача №1'''

print()
result = 1
for num in range(1, 100, 2):  # Устанавливаем шаг для получения нечетного числа
    result *= num
print(f'Произведение всех нечетных чмсел: {result}')

# **********************************************************************************************************************

'''Домашняя задача №2'''

print()
result = []
for num in range(1, 500):
    if num % 5 == 0:  # Проверка на кратность
        result.append(num)  # Если число кратно 5 - добавляем в список
print(result)

# **********************************************************************************************************************

'''Домашняя задача №3'''

print()
for num in range(1, 497):
    if num % 2 == 0:  # Проверка на четность числа
        print(num)

# **********************************************************************************************************************

'''Домашняя задача №4'''

print()
rand_list = [randint(1, 10) for i in range(20)]  # Заполняем список рандомными числами
print(rand_list)
result = []

for num in rand_list:
    if num not in result and rand_list.count(num) > 2:
        # Добавляем число в новый список, если количество его вхождений в рандомный список больше 2
        result.append(num)
print(result)
